[A_Item.Aster_Seraph_Antagonist_Shield ShieldDefinition]
UseFailureCharacterMessage="É preciso ser %s para usar esse item."
ItemName="Escudo Orbital"
PickupMessage="Você adquiriu um escudo orbital básico."
UseFailureLevelMessage="Você deve estar, pelo menos no nível %d para usar esse item."
UseFailureConstraintsMessage="Você não pode usar esse item."
NoManufacturerName="Genérico"

[A_Item.Aster_Seraph_Antagonist_Shield:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Ricocheteia as balas inimigas e as manda de volta."
NoConstraintText=""
Suffix=""
Prefix=""

[A_Item.Aster_Seraph_Antagonist_Shield:AttributePresentationDefinition_8 AttributePresentationDefinition]
Description="Lança bolas de [slag]Slag[-slag] teleguiadas contra seus inimigos."
NoConstraintText=""
Suffix=""
Prefix=""

[A_Item.Aster_Seraph_Blockade_Shield ShieldDefinition]
UseFailureCharacterMessage="É preciso ser %s para usar esse item."
ItemName="Escudo Orbital"
PickupMessage="Você adquiriu um escudo orbital básico."
UseFailureLevelMessage="Você deve estar, pelo menos no nível %d para usar esse item."
UseFailureConstraintsMessage="Você não pode usar esse item."
NoManufacturerName="Genérico"

[A_Item.Aster_Seraph_Blockade_Shield:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Concede uma [skill]resistência à danos[-skill] muito importante quando está totalmente carregado... e moderada quando não está."
NoConstraintText=""
Suffix=""
Prefix=""

[Misc.AttrPresent_BulletReflectedOffSelfDamageScale AttributePresentationDefinition]
Description="Danos por balas ricocheteadas"
NoConstraintText=""
Suffix=""
Prefix=""

[Misc.AttrPresent_BulletReflectedOffSelfDamageTakenScale AttributePresentationDefinition]
Description="Redução de danos"
NoConstraintText=""
Suffix=""
Prefix=""

[Misc.AttrPresent_BulletReflectionOffSelfChance AttributePresentationDefinition]
Description="Possibilidade de desvio"
NoConstraintText=""
Suffix=""
Prefix=""

[Skills.Antagonist_Shield_Skill SkillDefinition]
SkillName="Habilidade de escudo antagonista"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Blockade_Shield_Skill SkillDefinition]
SkillName="Habilidade de escudo de bloqueio"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Titles.Title_Antagonist ItemNamePartDefinition]
PartName="Antagonista"

[Titles.Title_Antagonist:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Sou feito de borracha... e você, de cola."
NoConstraintText=""
Suffix=""
Prefix=""

[Titles.Title_Blockade ItemNamePartDefinition]
PartName="Bloqueio"

[Titles.Title_Blockade:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Estou vivo ou morto?"
NoConstraintText=""
Suffix=""
Prefix=""

